---
kind: method
id: M:Autodesk.Revit.DB.ReferencePlane.GetPlane
source: html/a37ce3cd-aff7-6394-5b13-e2484550e511.htm
---
# Autodesk.Revit.DB.ReferencePlane.GetPlane Method

Returns the geometry plane to which the reference plane is assigned.

## Syntax (C#)
```csharp
public Plane GetPlane()
```

## Returns
The geometry plane to which the reference plane is assigned.